---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.ResourceNotFoundException
source: html/d0531b2a-c462-89f6-ea45-251aec86f8f2.htm
---
# ResourceNotFoundException Members

Retrieves data needed to serialize the target object.